Revit 2022 API
AreaReinforcement.IsSolidInView Method
 Checks if this Area Reinforcement is shown solidly in a 3D view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Syntax
C#
public bool IsSolidInView(
	View3D view
)
Visual Basic
Public Function IsSolidInView ( _
	view As View3D _
) As Boolean
Visual C++
public:
bool IsSolidInView(
	View3D^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 The 3D view element
Return Value
 True if Area Reinforcement is shown solidly, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace